[
    {
        "id": 1,
        "imagem": "https://www.adventureclub.com.br/wp-content/uploads/2020/08/barreirinhas-nos-lencois-maranhenses-galeria.jpeg",
        "lugar": "LENÇÓIS MARANHENSES",
        "cidade": "Barreirinhas, Santo Amaro e Atins",
        "descricao": "> \n\n  ### Lençóis Maranhenses \n\n Os Lençóis Maranhenses é um parque nacional localizado no estado do Maranhão, Brasil. Conhecido por suas deslumbrantes paisagens naturais, o parque é caracterizado por vastas dunas de areia branca que se estendem por quilômetros, intercaladas com lagoas de água doce de coloração azul-turquesa e verde-esmeralda, que se formam durante a estação chuvosa. \n\n \n\n ### Principais atrativos \n\n \n\n >**Dunas e Lagoas:** As dunas de areia branca, algumas chegando a 40 metros de altura, são um espetáculo visual. Entre elas, as lagoas sazonais, como a Lagoa Azul e a Lagoa Bonita, oferecem águas cristalinas ideais para banho e fotos impressionantes. \n\n ![imagem lençóis maranhenses](https://revista.bancorbras.com.br/wp-content/uploads/2023/12/Dunas-de-areias_Maranhao-scaled.jpg) \n\n > **Atins:** Um vilarejo tranquilo na borda do parque, Atins é conhecido por suas belas praias, excelente culinária local e ambiente relaxante. É também um ponto de partida para explorar as dunas e lagoas próximas. \n\n ![imagem cidade de Atins](https://www.carpemundi.com.br/wp-content/uploads/2019/09/atins.jpg) \n\n >**Barreirinhas:** Considerada a porta de entrada dos Lençóis Maranhenses, Barreirinhas oferece diversas opções de passeios, incluindo voos panorâmicos e tours de 4x4 que levam os visitantes para as áreas mais remotas do parque. \n\n ![imagem dunas de Barreirinhas](https://www.penaestrada.blog.br/wp-content/uploads/2017/09/onde-ficar-nos-lencois-maranheses-01.jpg) \n\n >**Santo Amaro:** Menos turístico e mais preservado, Santo Amaro oferece uma experiência mais autêntica dos Lençóis, com dunas e lagoas igualmente belas, além de passeios que podem incluir a interação com a comunidade local. \n\n ![imagem das dunas de Santo Amaro](https://viagenseoutrashistorias.com.br/wp-content/uploads/2016/06/Lenc%CC%A7ois-Maranhenses-1-46.jpg) \n\n >**Rio Preguiças:** Navegar pelo Rio Preguiças é uma das atrações principais, proporcionando uma visão diferente do parque e acesso a vilarejos como Caburé e Mandacaru, onde se pode visitar o Farol de Mandacaru para vistas panorâmicas da região. \n\n ![imagem do Rio Preguiças](https://www.guiaviagensbrasil.com/blog/wp-content/uploads/2013/08/rio-preguicas-maranhao.jpg) \n\n Os Lençóis Maranhenses são um destino único no mundo, oferecendo uma combinação incomparável de beleza natural e tranquilidade. \n\n  ",
        "atrativos": "Lagoa Azul - Lagoa Bonita - Passeios de Jipe - Caminhada nas Dunas",
        "localizacao": [
            { "name": "Lençóis Maranhenses", "coords": [-2.533333,  -43.116667] }
        ]
    },
    {
        "id": 2,
        "imagem": "https://www.gov.br/turismo/pt-br/centrais-de-conteudo/14-06-2016-chapada-das-mesas-jpg",
        "lugar": "CHAPADA DAS MESAS",
        "cidade": "Carolina, Riachão e Estreito",
        "descricao": "> \n\n  ### Chapada das Mesas \n\n A Chapada das Mesas é um parque nacional situado no sul do estado do Maranhão, Brasil. Conhecida por suas formações rochosas impressionantes, cachoeiras exuberantes e uma rica biodiversidade, a Chapada das Mesas é um destino imperdível para os amantes da natureza e do ecoturismo. \n\n \n\n ### Principais atrativos \n\n \n\n >**Cachoeira do Itapecuru:** Também conhecida como Cachoeira da Pedra Caída, é um dos principais cartões-postais da Chapada. A água cai de uma altura de aproximadamente 46 metros, formando uma bela piscina natural ideal para banho. \n\n ![imagem cachoeira de Itapecuru](https://www.escolhaviajar.com/wp-content/uploads/2021/01/fotos-da-chapada-das-mesas-Cachoeiras-do-Itapecuru-4.jpg) \n\n > **Complexo da Pedra Caída:** Um complexo turístico que oferece várias atividades, incluindo trilhas, rapel e tirolesa. A principal atração é a Cachoeira do Santuário, uma queda d'água espetacular cercada por paredes rochosas imponentes. \n\n ![imagem Complexo da Pedra Caída](https://static.wixstatic.com/media/b76b33_6d5fedb262d441deb647083138f100b5~mv2.jpg/v1/fill/w_1200,h_800,al_c/b76b33_6d5fedb262d441deb647083138f100b5~mv2.jpg) \n\n >**Encanto Azul:** Uma nascente de águas cristalinas com tons de azul intenso, perfeita para mergulho e snorkel. A visibilidade da água é impressionante, permitindo observar a vida aquática em detalhes. \n\n ![imagem Encanto Azul](https://www.maladeaventuras.com/wp-content/uploads/2018/10/poco-azul-e-encanto-azul-destaque.jpg) \n\n >**Poço Azul:** Outra piscina natural de águas cristalinas, cercada por uma vegetação exuberante. É um ótimo local para relaxar e nadar, desfrutando da tranquilidade do ambiente. \n\n ![imagem Poço Azul](https://www.viagensecaminhos.com/wp-content/uploads/2021/08/poco-azul-chapada-das-mesas.jpg) \n\n >**Portal da Chapada:** Um mirante natural formado por uma grande rocha em forma de portal. Oferece uma vista panorâmica da região e é um ótimo lugar para apreciar o pôr do sol. \n\n ![imagem Portal da Chapada](https://www.penaestrada.blog.br/wp-content/uploads/2020/08/chapada-das-mesas-13.jpg) \n\n >**Trilha do Morro do Chapéu:** Uma trilha que leva ao topo de uma das formações rochosas mais altas da Chapada. A vista do topo é deslumbrante, proporcionando uma visão ampla das paisagens ao redor. \n\n ![imagem Trilha do Morro do Chápeu](https://meudestinoelogoali.com.br/wp-content/uploads/2019/06/Morro-do-Chap%C3%A9u-@meudestinoelogoali.jpeg) \n\n A Chapada das Mesas é um destino que combina aventura, beleza natural e tranquilidade, oferecendo uma experiência única e memorável para seus visitantes. \n\n  ",
        "atrativos": "Cachoeira do Itapecuru (Cachoeira Gêmeas) - Cachoeira de Santa Bárbara - Poço Azul",
        "localizacao": [
            { "name": "Chapada das Mesas", "coords": [-7.316667,  -47.335] }
        ]
    },
    {
        "id": 3,
        "imagem": "https://oimparcial.com.br/app/uploads/2019/07/0b3a8062e3ddf6364234d846c6ed1782-1024x576.jpg",
        "lugar": "MORROS",
        "cidade": "Cidade de Morros",
        "descricao": "> \n\n  ### Morros \n\n Morros é uma charmosa cidade localizada no estado do Maranhão, Brasil. Situada a cerca de 100 km de São Luís, Morros é conhecida por sua rica natureza, rios de águas claras e uma atmosfera tranquila, ideal para quem busca um refúgio em meio à natureza. \n\n \n\n ### Principais atrativos \n\n \n\n >**Rio Una:** Um dos principais pontos turísticos de Morros, o Rio Una é famoso por suas águas cristalinas e tranquilas. Ideal para banho, passeios de canoa e stand-up paddle, oferece um ambiente perfeito para relaxar e aproveitar a natureza. \n\n ![imagem Rio Una](https://oimparcial.com.br/app/uploads/2020/03/64146927.jpg) \n\n > **Balneário Prainha:** Localizado às margens do Rio Una, este balneário é um dos locais mais populares da cidade. Com infraestrutura para receber visitantes, é ótimo para piqueniques, natação e momentos de lazer. \n\n ![imagem Balneário Prainha](https://oimparcial.com.br/app/uploads/2020/03/WhatsApp-Image-2019-12-18-at-07.24.04-1.jpeg) \n\n >**Cachoeira do Arruda:** Uma pequena, mas encantadora cachoeira situada em meio à vegetação nativa. O local é perfeito para um banho refrescante e um momento de paz, cercado pela natureza. \n\n ![imagem Cachoeira do Arruda](https://www.enquantoissonomaranhao.com.br/wp-content/uploads/2018/07/IMG_3476.jpg) \n\n >**Pedra da Baliza:** Um ponto de interesse natural, a Pedra da Baliza é uma formação rochosa que oferece uma bela vista da região. É um ótimo lugar para caminhadas e para admirar a paisagem local. \n\n ![imagem Pedra da Baliza](https://escaladas.com.br/img/dinamica/montanha/946/principal/946-120920-1.png) \n\n >**Praia de São José de Ribamar:** Embora não esteja exatamente em Morros, esta praia próxima é um destino popular entre os visitantes da região. Com areia branca e águas tranquilas, é ideal para um dia de descanso à beira-mar. \n\n ![imagem Praia São José de Ribamar](https://www.turismoecia.net/wp-content/uploads/2020/05/S%C3%A3o-Jos%C3%A9-do-Ribamar-Praia-de-Ponta-verde-Por-Roosewelt-Lins-Obra-do-pr%C3%B3prio-CC-BY-SA-3.0.jpg) \n\n Morros é um destino que combina natureza exuberante, tranquilidade e cultura local, oferecendo uma experiência autêntica e relaxante para seus visitantes. \n\n  ",
        "atrativos": "Pedra da Memória - Poço Verde - Cachoeira do Arruda - Balneário Prainha",
        "localizacao": [
            { "name": "Morros", "coords": [-2.863889,  -44.038889] }
        ]
    },
    {
        "id": 4,
        "imagem": "https://www.voltologo.net/wp-content/uploads/2023/02/centro-historico-de-sao-luis-dicas.jpg.webp",
        "lugar": "CENTRO HISTÓRICO",
        "cidade": "São Luís",
        "descricao": "> \n\n  ### Centro Histórico \n\n O Centro Histórico de São Luís, capital do Maranhão, é um tesouro cultural e arquitetônico do Brasil. Fundada em 1612 por franceses e posteriormente colonizada por portugueses, a cidade preserva um conjunto notável de edifícios coloniais que refletem sua rica história e diversidade cultural. Reconhecido como Patrimônio Mundial pela UNESCO, o Centro Histórico de São Luís encanta os visitantes com suas ruas de paralelepípedos, casarões coloridos e uma vibrante vida cultural. \n\n \n\n ### Principais atrativos \n\n \n\n >**Palácio dos Leões:** Sede do governo estadual, o Palácio dos Leões é um imponente edifício colonial que oferece vistas panorâmicas do Rio Anil. Além de sua importância política, o palácio possui um acervo de obras de arte e móveis históricos. \n\n ![imagem Palacio dos Leoes](https://portalamazonia.com/wp-content/uploads/2022/11/b2ap3_large_up_47_prefeituraaa.jpg) \n\n > **Teatro Arthur Azevedo:** Inaugurado em 1817, é um dos teatros mais antigos do Brasil. O teatro é conhecido por sua arquitetura neoclássica e sua rica programação cultural, incluindo peças, concertos e balés. \n\n ![imagem Teato Arthur Azevedo](https://dynamic-media-cdn.tripadvisor.com/media/photo-o/0a/99/c1/40/plateia-do-teatro-lustre.jpg?w=1200&h=-1&s=1) \n\n >**Rua Portugal:** Uma das ruas mais famosas do Centro Histórico, a Rua Portugal é conhecida por seus belos casarões com azulejos portugueses e balcões de ferro. É um ótimo lugar para caminhar e apreciar a arquitetura colonial. \n\n ![imagem Rua Portugal](https://viajantesemfim.com.br/wp-content/uploads/2022/03/274959855_4837054646414267_1886872788843986212_n.jpg) \n\n >**Igreja da Sé:** Também conhecida como Catedral de São Luís, esta igreja é um marco histórico e religioso da cidade. Sua construção remonta ao século XVII e seu interior abriga belos altares e obras de arte sacra. \n\n ![imagem Igreja da Sé](https://turismo.b-cdn.net/wp-content/uploads/2017/02/Igreja-da-S%C3%A9-em-S%C3%A3o-Lu%C3%ADs-do-Maranh%C3%A3o.jpg) \n\n >**Convento das Mercês:** Fundado em 1654, este convento é um importante patrimônio histórico e atualmente abriga um centro cultural com exposições e eventos. O edifício também oferece uma vista maravilhosa do entorno. \n\n ![imagem convento das mercês](https://upload.wikimedia.org/wikipedia/commons/5/51/Convento_das_Merc%C3%AAs_%28884796809%29.jpg) \n\n O Centro Histórico de São Luís é um lugar onde a história e a cultura se entrelaçam, proporcionando uma experiência enriquecedora e memorável aos visitantes que desejam explorar o passado e a essência desta cidade encantadora. \n\n  ",
        "atrativos": "Palácio dos Leões - Convento das Mercês - Igreja da Sé - Rua Portugal - Fonte do Ribeirão",
        "localizacao": [
            { "name": "Centro Histórico", "coords": [-2.53,  -44.302778] }
        ]
    },
    {
        "id": 5,
        "imagem": "https://emalgumlugardomundo.com.br/wp-content/uploads/2023/05/delta-do-parnaiba-piaui-ilha-melanceiras.jpg",
        "lugar": "DELTA DO PARNAÍBA",
        "cidade": "Tutóia",
        "descricao": "> \n\n  ### Delta do Parnaíba \n\n Tutóia é uma charmosa cidade maranhense situada na entrada do Delta do Parnaíba, um dos mais espetaculares e únicos deltas em mar aberto do mundo. A cidade serve como um excelente ponto de partida para explorar as maravilhas naturais do delta, que é uma vasta área de rios, canais, manguezais e ilhas, formando um verdadeiro labirinto aquático. \n\n \n\n ### Principais atrativos \n\n \n\n >**Ilhas do Delta:** A partir de Tutóia, é possível explorar várias ilhas do delta, como a Ilha das Canárias e a Ilha do Caju. Essas ilhas oferecem paisagens intocadas, praias desertas e uma rica biodiversidade, ideal para passeios de barco e trilhas ecológicas. \n\n ![imagem Ilha deltas](https://maranhaodeencantos.com.br/wp-content/uploads/2022/02/delta1.jpg) \n\n > **Revoada dos Guarás:** Este é um dos espetáculos naturais mais fascinantes do delta. Ao entardecer, bandos de guarás, aves de plumagem vermelha intensa, retornam aos seus ninhos, criando uma visão impressionante contra o pôr do sol \n\n ![imagem Revoada dos Guarás](https://turistaprofissional.com/wp-content/uploads/2019/11/rota-das-emocoes-piaui.jpg) \n\n >**Praia do Amor:** Uma das praias mais conhecidas de Tutóia, a Praia do Amor é famosa por suas águas calmas e cristalinas, além de suas formações de dunas. É um excelente local para relaxar e desfrutar da beleza natural. \n\n ![imagem Praia do Amor](https://enquantoissonomaranhao.com.br/wp-content/uploads/2020/03/88276795_2324362647667310_5085031138599108608_o.jpg) \n\n >**Praia da Barra:** Situada na foz do Rio Parnaíba, a Praia da Barra oferece um cenário paradisíaco com suas areias brancas e águas límpidas. É um ótimo lugar para a prática de esportes aquáticos e passeios de barco. \n\n ![imagem Praia da Barra](https://dynamic-media-cdn.tripadvisor.com/media/photo-o/18/8e/63/8c/photo2jpg.jpg?w=600&h=500&s=1) \n\n >**Laguna da Taboa:** Uma belíssima laguna de águas calmas e cristalinas, cercada por vegetação típica da região. É um local perfeito para um banho refrescante e para apreciar a tranquilidade da natureza. \n\n ![imagem Praia São José de Ribamar](https://www.viagenscinematograficas.com.br/wp-content/uploads/2020/02/Tutoia-Maranhao-Pequenos-Lencois-2.jpg) \n\n Tutóia, com sua localização privilegiada e proximidade ao Delta do Parnaíba, oferece aos visitantes uma experiência única de contato direto com a natureza, combinando tranquilidade, aventura e a beleza exuberante dos ecossistemas aquáticos e costeiros. \n\n  ",
        "atrativos": "Ponta do Mangue - Passeios de Lancha e Canoagem - Manguezais - Laguna da Taboa",
        "localizacao": [
            { "name": "Delta do Parnaíba", "coords": [-2.761944,  -42.273889] }
        ]
    },
    {
        "id": 6,
        "imagem": "https://i.pinimg.com/736x/2e/3a/50/2e3a5060ad9d31829cbda530df37c709.jpg",
        "lugar": "ILHA DE LENÇÓIS",
        "cidade": "Apicum-açu - Cururupu",
        "descricao": "> \n\n  ### Ilha de Lençóis \n\n A Ilha de Lençóis, situada no município de Cururupu, no estado do Maranhão, é um destino paradisíaco ainda pouco explorado pelo turismo de massa. Parte do Arquipélago de Maiaú, a ilha é conhecida por suas praias desertas, formações de dunas e uma atmosfera tranquila, ideal para quem busca um refúgio natural. \n\n \n\n ### Principais atrativos \n\n \n\n >**Praias Desertas** A Ilha de Lençóis é famosa por suas extensas praias de areia branca e fina, praticamente desertas. As praias oferecem um ambiente tranquilo e perfeito para relaxar, tomar sol e nadar em águas cristalinas. \n\n ![imagem Ilha de Lençõis](https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Ilha_dos_Len%C3%A7%C3%B3is_-_Litoral_Ocidental_do_Maranh%C3%A3o_-_Cururupu_-_MA_-_panoramio.jpg/1280px-Ilha_dos_Len%C3%A7%C3%B3is_-_Litoral_Ocidental_do_Maranh%C3%A3o_-_Cururupu_-_MA_-_panoramio.jpg) \n\n > **Dunas:** As formações de dunas são um dos principais atrativos da ilha. As dunas criam um cenário deslumbrante, com paisagens que lembram os famosos Lençóis Maranhenses. Caminhar pelas dunas e observar o pôr do sol é uma experiência imperdível. \n\n ![imagem Dunas Ilha de Lençóis](https://conteudo.imguol.com.br/c/galeria/f9/2021/06/25/ilha-dos-lencois-1624651536315_v2_1170x540.jpg) \n\n A Ilha de Lençóis em Cururupu é um destino que combina a tranquilidade de praias desertas com a beleza natural das dunas e a riqueza da vida selvagem, oferecendo aos visitantes uma experiência inesquecível de conexão com a natureza e a cultura local. \n\n  ",
        "atrativos": "Dunas - Comida Local - Lagoas Cheias - Praias Desertas",
        "localizacao": [
            { "name": "Ilha de Lençóis", "coords": [-1.319291, -44.884796] }
        ]
    }
]